{
    "badPageHandler.js": {

    },
    "emailHandler.js": {
        "2000": {
            "Description":"Attempted to send a email to a user but it failed to be sent for some reason",
            "function": "emailHandler"
        }
    },
    "fileHandler.js": {
        "1700":{
            "Description":"Some unexpected Multer Error occurred when a user was uploading a picture",
            "function": "imageHandler"
        },
        "1701":{
            "Description":"Some unexpected FileUploadError occurred when a user was uploading a picture",
            "function":"imageHandler"
        },
        "1702":{
            "Description":"The AWS s3 access key was invalid when a user was uploading a picture",
            "function":"imageHandler"
        },
        "1703":{
            "Description":"The AWS s3 key signature did not match when a user was uploading a picture",
            "function":"imageHandler"
        },
        "1704":{
            "Description":"The AWS s3 bucket could not be found when a user was uploading a picture",
            "function":"imageHandler"
        },
        "1705":{
            "Description":"Some unexpected error occurred when a user was uploading a picture",
            "function":"imageHandler"
        },
        "1705":{
            "Description":"When a user was uploading a file, a unique file name could not be found after 5 tries",
            "function":"imageHandler"
        },
        "1706":{
            "Description":"When removing a image, some unexpected error occurred",
            "function":"removeImage"
        },
        "1707":{
            "Description":"When a user was uploading a image, some error occurred when checking the database to see if that file exists",
            "function":"multerS3"
        }
    },
    "getUserInfo.js":{

    },
    "globals.js":{
        "2200":{
            "Description":"Some unexpected error occurred when trying to increment a users login attempts",
            "function":"updateUserLoginAttempts"
        }
    },
    "index.js":{

    },
    "login.js":{
        "1600":{
            "Description": "An error occurred when trying to remove a no longer valid TempVerificationCode record",
            "function":"validateUserForVerification"
        },
        "1602":{
            "Description":"A error occurred sending out a users verification code through email",
            "function":"forgotPassword"
        },
        "1603":{
            "Description":"A error occurred when updating a users record when they just logged in.  Database was not able to update last login, password attempts, etc.",
            "function":"checkLogin"
        },
        "1604":{
            "Description":"A error occurred when updating a users verifcation attempts on a failed attempt",
            "function":"validatePassCode"
        },
        "1605":{
            "Description":"A error occurred when updating a users verifcation attempts when they just validated the verification code",
            "function":"validatePassCode"
        },
        "1606":{
            "Description":"A error occurred when updating a users verification attempts.  The users attempts are set to less than or equal to 3 but the verificationLocked timestamp is not null",
            "function":"forgotPassword"
        },
        "1607":{
            "Description":"An error occurred when updating a users verification attempts.  The users attempts are greater than 3 but the verificationLocked timestamp is null",
            "function":"forgotPassword"
        },
        "1608":{
            "Description":"An error occurred when updating a users verification attempts.  Some unexpected combination of the users attempts and verificationLocked time was detected",
            "function":"forgotPassword"
        },
        "1609":{
            "Description":"An error occurred when updating a users verification attempts.  THe user either did not exist or the update did not succeed for some reason",
            "function":"forgotPassword"
        },
        "1610":{
            "Description":"An error occurred when saving a users temp verificaion code record to the database.",
            "function":"forgotPassword"
        },
        "1611":{
            "Description":"Could not succesfully generate a unique salt that is not being used after 5 attempts for a users temporary verificaiton code",
            "function":"forgotPassword"
        },
        "1614":{
            "Description":"An unexpected error occurred when trying to increment a users password attempts when a user provided invalid credentials",
            "function":"checkLogin"
        },
        "1615":{
            "Description":"An unexpected error occurred when trying to increment a users password attempts when a user tried to login to an account that was already locked",
            "function":"validateUser"
        }
    },
    "movies.js":{
        "1500":{
            "Description":"A user was trying to add a movie to their watch list but the update to the database failed.  Usually means the association already exists.",
            "function":"addToWatchList"
        },
        "1501":{
            "Description":"A user was trying to remove a movie from their watch list but the update to the database failed",
            "function":"removeFromWatchList"
        },
        "1502":{
            "Description":"A user was trying to add a movie to their watched list but the udpate to the database failed.  Usually means the association already exists.",
            "function":"addToWatched"
        },
        "1503":{
            "Description":"A user was trying to remove a movie from their watched list but the update to the database failed",
            "function":"removeFromWatchedList"
        }
    },
    "profile.js":{
        "1000":{
            "Description": "Occurs if res.locals.skipAuthentication is set to true but the type is not.  for updating the users image.  This should just about never occur as res.locals.skipAuthentication is only.  Set to true if updating a users image",
            "function": "profileHandler"
        },
        "1001":{
            "Description": "A user tried to follow another user but the update to the database failed",
            "function": "followUser"
        },
        "1002":{
            "Description": "A user tried to unfollow another user but the update to the database failed",
            "function": "unfollowUser"
        },
        "1004":{
            "Description":"A user tried to update their information but some unexpected constraint error occurred",
            "function":"updateInfo"
        },
        "1005":{
            "Description":"A user tried to update their information but some unexpected database failure occurred",
            "function":"updateInfo"
        },
        "1006":{
            "Description":"A user tried to delete their account but the update to the database failed",
            "function":"removeUser"
        },
        "1007":{
            "Description":"Some unexpected constraint error occurred when a user tried to set their picture to null",
            "function":"removeProfilePicture"
        },
        "1008":{
            "Description":"A user tried to delete their profile picture but the update to the database failed",
            "function":"removeProfilePicture"
        },
        "1009":{
            "Description":"A user tried to delete their profile picture but some unexpected error occured when removing it from AWS",
            "function":"removeProfilePicture"
        },
        "1010":{
            "Description":"A user tried to upate their picture but it overwrote another users picture as they have the same file name, thus two users pictures are now wrong",
            "function":"updateImage"
        },
        "1011":{
            "Description":"Some unexpected constraint error occured when a user tried to update their picture on the database",
            "function":"updateImage"
        },
        "1012":{
            "Description":"Some unexpected error occurred when a user tried to update their picture on the database",
            "function":"updateImage"
        },
        "1013":{
            "Description":"The salt used to encrypt the users password was already in use",
            "function":"updatePassword"
        },
        "1014":{
            "Description":"Could not generate a unique salt when trying to store the users new password",
            "function":"resetPassword"
        }
    },
    "reviewCreator.js":{
        "1100":{
            "Description":"A user attempted to create a review but it failed to be created on the database for some reason",
            "function":"createReview"
        },
        "1101":{
            "Description":"Some unexpected foreign key constraint error occurred when a user was updating or creating a review",
            "function":"reviewErrorHandler"
        },
        "1102":{
            "Description":"Some unexpected constraint error occurred when a user was updating or creating a review",
            "function":"reviewErrorHandler"
        },
        "1103":{
            "Description":"Some unexpected error occurred on the database when a user tried to update or create a review",
            "function":"reviewErrorHandler"
        },
        "1104":{
            "Description":"Some unexpected constraint error occurred when adding a tag to a review",
            "function":"createReviewTagAssociation"
        },
        "1105":{
            "Description":"Some unexpected error occurred when adding a tag to a review",
            "function":"createReviewTagAssociation"
        }

    },
    "reviews.js":{
        "1200":{
            "Description":"A user tried to delete a review but the update to the database failed",
            "function":"removePost"
        },
        "1201":{
            "Description":"A user tried to like a review post but the update to the database failed",
            "function":"addLike"
        },
        "1202":{
            "Description":"A user tried to remove a like from a review post but the update to the database failed",
            "function":"removeLike"
        },
        "1203":{
            "Description":"A user tried to post a comment on a review post but a unknown constraint error occurred",
            "function":"postComment"
        },
        "1205":{
            "Description":"A user tried to update a comment on a review post but the update to the database failed",
            "function":"updateComment"
        },
        "1206":{
            "Description":"A user tried to remove a comment from a review post but the update to the database failed",
            "function":"commentRemoval"
        }
    },
    "search.js":{

    },
    "signup.js":{
        "1300":{
            "Description":"A user was attempting to sign up but some unexpected constraint error occurred",
            "function":"createTempUser"
        },
        "1302": {
            "Description":"A user was attempting to sign up but the verification email failed to be sent out",
            "function":"createTempUser"
        },
        "1304": {
            "Description":"A user attempting to sign up tried to have their verification code resent but the email did not get sent out",
            "function":"resendVerificationCode"
        },
        "1305": {
            "Description":"When creating a users official account the update to the database failed",
            "function":"createUser"
        },
        "1306": {
            "Description":"When removing a temporary user the update to the database failed",
            "function":"removeTempUser"
        },
        "1307": {
            "Description":"A user was attempting to sign up but unable to generate a unique salt to encrypt their password",
            "function":"createTempUser"
        },
        "1308":{
            "Description":"A user was attempting to sign up but unable to generate a unique salt to encrypt their verification code",
            "function":"createTempUser"
        },
        "1309":{
            "Description":"A user was attempting to sign up but unable to generate a unique salt to encrypt their verification code.  When attempting to remove the temp user another error occurred",
            "function":"createTempUser"
        },
        "1310":{
            "Description":"A user was attempting to sign up but a unexpected error occurred when creating their verification code.  When attempting to remove the temp user another error occurred",
            "function":"createTempUser"
        },
        "1311":{
            "Description":"A user was attempting to resend their verification code but unable to generate a unique salt to encrypt their verification code",
            "function":"resendVerificationCode"
        },
        "1312":{
            "Description":"A users new verification code was sent out but some unexpected error occurred incrementing their codes resent",
            "function":"resendVerificationCode"
        }, 
        "1313":{
            "Description":"A user was attempting to resend their verification code but was unable to create a new record as a record already existed for the user.  The record was most likely created after the delete finished",
            "function":"resendVerificationCode"
        },
        "1314":{
            "Description":"A user was attempting to sign up but unable to generate a unique salt to encrypt their password.  When attempting to remove the temp user another error occurred",
            "function":"createTempUser"
        },
        "1315":{
            "Description":"A user was attempting to sign up but a unexpected error occurred when creating their password record.  When attempting to remove the temp user another error occurred",
            "function":"createTempUser"
        },
        "1316":{
            "Description":"A user was attempting to sign up but a unexpected error occurred when creating their authentication attemps record.  When attempting to remove the temp user another error occurred",
            "function":"createTempUser"
        },
        "1317":{
            "Description":"When attempting to create a users Authentication Attempts record, the users id did not exist",
            "function":"createTempUser"
        },
        "1318":{
            "Description":"A user was attempting to sign up but an error occurred when creating their authentication attemps record.  When attempting to remove the user another error occurred",
            "function":"createTempUser"
        },
        "1319":{
            "Description":"A unverified user account exists without a authentication attempts record",
            "function":"resendVerificationCode"
        },
        "1320":{
            "Description":"A unverified user account exists without a authentication attempts record",
            "function":"createUser"
        },
        "1321":{
            "Description":"A unexpected error occurred when trying to remove a user that has expired",
            "function":"createUser"
        },
        "1322":{
            "Description":"A unexpected error occurred when trying to remove a unverified user",
            "function":"createUser"
        },
        "1323":{
            "Description":"A unexpected error occurred when trying to remove a user that has expired",
            "function":"resendVerificationCode"
        },
        "1324":{
            "Description":"Failed to create a user and the user returned from the find or create was null",
            "function": "createTempUser"
        },
        "1325":{
            "Description":"A unexpected error occurred when trying to remove a user that has expired",
            "function":"createTempUser"
        }
    },
    "sequelizeErrorHandler.js":{
        "1800":{
            "Description":"Some unexpected sequelize error occurred"
        },
        "1801":{
            "Description":"Some unexpected foreign key constraint error occurred"
        },
        "1802":{
            "Description":"Some unexpected unique constraint error occurred"
        }
    },
    "defaultErrorHandler.js":{
        "1900":{
            "Description":"Some unexpected error occurred"
        }
    },
    "sessions.js":{
        "2100":{
            "Description": "When generating a new session for a user, there was a error removing the old session",
            "function":"regenerateSession"
        }
    }, 
    "errorHandler.js":{
        "2200":{
            "Description": "A error occurred in the main error handler",
            "function":"errorHandler"
        }
    }
}
